a1 = float(input("Введите длину первой диагонали ромба: "))
a2 = float(input("Введите длину второй диагонали ромба: "))
pl = float(a1 * a2 / 2.0)
print(float(pl))

a1 = float(input("Первая диагональ ромба равна (в см) "))
a2 = float(input("Вторая диагональ ромба равна (в см) "))
print(f"Площадь ромба равна {a1 * a2 / 2}")

a1 = float(input("Первая диагональ ромба равна (в см) "))
a2 = float(input("Вторая диагональ ромба равна (в см) "))
print("Диагональ ромба равна {}".format(a1 * a2 / 2))